apigeetools/data/getUserProfile.txt

<soapenv:Envelope xmlns:ser="http://services.security.framework.ea.glic.com" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header>
      <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
         <wsse:UsernameToken wsu:Id="UsernameToken-F1BBAC12BC0F46754F14319685044621">
            <wsse:Username>oc_service_id</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">Or4ng3ade</wsse:Password>
            <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">UFt5Lljk/zpHbxbYg+afgQ==</wsse:Nonce>
            <wsu:Created>2015-05-18T17:01:44.460Z</wsu:Created>
         </wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <ser:getUserProfile>
         <userID>berkm2w</userID>
         <callerID>dWmNWzwGw9EKnfmI5feLrg==</callerID>
         <profileType>default</profileType>
         <additionalParameters>
            <!--Zero or more repetitions:-->
            <item>
               <!--You may enter the following 2 items in any order-->
               <key></key>
               <value></value>
            </item>
         </additionalParameters>
      </ser:getUserProfile>
   </soapenv:Body>
</soapenv:Envelope>